import type { DashboardColumnType } from '@/types/dashboard.types'

export default (): Promise<DashboardColumnType[]> => {
    return new Promise((resolve) => {
        setTimeout(() => {
            resolve(
                [
                    {
                        title: 'TO DO',
                        cards: [
                            {
                                id: '1',
                                name: 'Заголовок',
                                description: 'Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание',
                            },
                            {
                                id: '2',
                                name: 'Заголовок',
                                description: 'Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание',
                            },
                        ],
                    },
                    {
                        title: 'IN DEVELOPMENT',
                        cards: [
                            {
                                id: '3',
                                name: 'Заголовок',
                                description: 'Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание',
                            },
                            {
                                id: '4',
                                name: 'Заголовок',
                                description: 'Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание',
                            },
                        ],
                    },
                    {
                        title: 'IN REVIEW',
                        cards: [
                            {
                                id: '5',
                                name: 'Заголовок',
                                description: 'Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание',
                            },
                            {
                                id: '6',
                                name: 'Заголовок',
                                description: 'Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание',
                            },
                        ],
                    },
                    {
                        title: 'IN RELEASE',
                        cards: [
                            {
                                id: '7',
                                name: 'Заголовок',
                                description: 'Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание',
                            },
                            {
                                id: '8',
                                name: 'Заголовок',
                                description: 'Описание Описание Описание Описание Описание Описание Описание Описание Описание Описание',
                            },
                        ],
                    },
                ])
        }, 1500)
    })
}
